Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/faq-build_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: faq-build title: Babel, JSX, and Build Steps permalink: docs/faq-build.html layout: docs category: FAQ ---
ja: --- id: faq-build title: Babel、JSX、ビルドステップ permalink: docs/faq-build.html layout: docs category: FAQ ---

source: ### Do I need to use JSX with React?
ja: ### React では JSX を使用する必要がありますか？

source: No!
ja: いいえ！

source: Check out ["React Without JSX"](/docs/react-without-jsx.html) to learn more.
ja: 詳細は ["JSX なしで React を使う"](/docs/react-without-jsx.html) をご覧ください。

source: ### Do I need to use ES6 (+) with React?
ja: ### React では ES6（もしくはそれ以降のバージョン）を使用する必要がありますか？

source: Check out ["React Without ES6"](/docs/react-without-es6.html) to learn more.
ja: 詳細は ["ES6 なしで React を使う"](/docs/react-without-es6.html) をご覧ください。

source: ### How can I write comments in JSX?
ja: ### JSX の中にコメントを記述するには？
